# შექმენით რენდომ პაროლის დასაგენერირებელი პროგრამა, რომელიც დააგენერირებს 8 სიმბოლოიან პაროლს, რომელიც უნდა შეიცავდეს
# 2 სპეციალურ სიმბოლოს (მაგალითად: ! @ # $ % და სხვა)
# 2 ასოს
# 4 ციფრს

# რენდომ მოდულის შემოტანა
import random

# სპეციალური სიმბოლოების სია
symbols = ['!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '-', '_', '=', '+', '{', '}', '[', ']', '|', '\\', ':', ';', "'", '"', '<', '>', ',', '.', '?', '/','~']

# ასოების სია (დიდი და პატარა)
letters = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p','q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']

# პაროლის ცვლადის დეკლალირება
password = []

# for ციკლის გამოყენებით, ორჯერ ვქმნით რენდომ სიმბოლო და ასო, რომლესაც ვინახავთ პაროლის ცვლადში
for i in range(2) :
    password.append(random.choice(symbols))
    password.append(random.choice(letters))

# for ციკლის გამოყენებით, 4-ჯერ ვქმნით რენდომ რიცხვს და ვინახავთ აროლის ცვლადში
for i in range(4) :
    password.append(str(random.randint(0, 9)))

final_password = ""
for i in range(len(password)) :
    i = random.choice(password)
    final_password += i
    password.remove(i)
# პაროლის სიის 8 ელემეტის რენდომად არჩევა და საბოლოო პაროლის ცვლადში დამატება, ასევე პაროლის სიიდან რენდომად არჩეული ელემენტის წაშლა, რათა არ მოხდეს რენდომას ელემენტების არჩევისას და საბოლოო პაროლის ცვლდაში დამატებისას ერთი და იგივე ელემენტის არჩევა და მოხდეს რვავე ელემენტის არჩევა და რენდომულად შენახვა საბოლოო პაროლის ცვლდაში, რათა გქვონდეს რენდომულად თანმიმდევრობა

# რენდომ პაროლის გენერაცია
print("Your password is:")
print(final_password)