# 1. გააკეთეთ 3 ცალი სწორი კოდი და 3 ცალი არასწორი კოდი და უნდა ახსნათ რატომ არის ეს კოდი სწორი და რატომ არის ეს კოდი არასწორი

#სწორი გზა

name = "Meli" # სტრინგს აქვს ბრჭყალები
age = 33 # ცვლადისთვის ხდება მნიშვნელობის მინიჭება უდრის (=) ნიშანით
print("Meli") # ფუნქციაა და აქვს ფრჩხილები, ასევე სტრინგი სწორადაა გადაცემული ბრჭყალებით
#ან
print(name) # ფუნქციაა და აქვს ფრჩხილები, ასევე სწორადაა გადაცემული ცვლადი

#არასწორი გზა

name = Meli # სტრინგს აკლია ბრჭყალები
age > 33 # ცვლადისთვის არ ხდება მნიშვნელობის მინიჭება უდრის (=) ნიშანით
print"Meli" # ფუნქციაა და აკლია ფრჩხილები