# 2. ახსენით debugger-ი რაარის კომენტარებით და გააკეთეთ ასევე მაგალითებიც

# debugger-ი კითხულობს კოდს და ამოწმებს მას სისწორეზე, შეცდომის შემთხვევაში კოდი შესრულება ჩერდება და გამოაქვს შეცდომა ტერმილანში, რათა შევძლოთ შეცდომის წაკითხვა და გასწორება
print(surname)
surname = "Roldan"

#მაგალითად, ზემოთა კოდის გაშვების შემდეგ, ტერმინალში აგდებს შეცდომას:  "File "c:\Users\hp\Desktop\python course\level 5\homework\homework.py", line 16, in <module>; print(surname) ^^^^^^^ NameError: name 'surname' is not defined", რაც გვეუბნება რომ 16 ხაზზე ცვლადი surname არ არის განსაზღვრული, ვინაიდან მისი განსაზღვრა ხდება პრინტის შემდეგ, რაც არ არის სწორი თანმიმდევრობა და შესაბამისად კოდი ვერ შესრულდა