# შექმენით სია სხვადსხვა რიცხვებით და გამოტანეთ ამ რიცხვების ჯამი
# დაპრინტეთ ყველა რიცხვი და დავუწეროთ ლუწია თუ კენტი

numbers = [10, 2, 23, 64, 45, 36, 5] # ვადეკლარირებთ სიის ცვლადს სახელით numbers და ტოლობის ნიშნით ვანიჭებთ მნიშვენელობას კვადრატულ ფრჩხილებით შექმნილი სიის სახით, სადაც ელემენტები გამოყოფილია მძიმით

sum = 0 # შევქმენით ჯამის ცვლადი რომელსაც მინავიჭეთ მნიშვნელობა ნული და რომელსაც დავუმატებთ სიის ელემენტებს რათა ბოლოში მივიღოთ ჯამი

for num in numbers :
    # შევქმენით for ციკლი, რომელიც ტრიალებს numbers სიაში და თითოუელ იტერაციაზე თითოეული ელემენტი ჯდება num საინტერაციო ცვლადში
    sum += num # თითოეული საიტერაციო ცვლადის მნიშვნელობა თითოეულ იტერაციაზე ემატება ჯამის ცვლადს 
print(sum) # გამოგვაქვს ჯამის ცვლადის მნიშვნელობა

for num in numbers :
    # შევქმენით for ციკლი, რომელიც ტრიალებს numbers სიაში და თითოუელ იტერაციაზე თითოეული ელემენტი ჯდება num საინტერაციო ცვლადში
    if num % 2 == 0 : 
        # if-ი თითოეულ იტერაციაზე ვამოწმებთ საიტერაციო ცვლადის მნიშვნელობა არის თუ არა ლუწი მოდულუს ოპერატორის საშუალებით, რომელიც  გვაძლევს რიცხვის გაყოფის შედეგად დარჩენილ ნაშთს თუ ნაშთი არის 0, მაშინ ეს რიცხვი ლუწია
        print(num, " - Even") # ვპრინტავთ საიტერაციო ცვლადის მნიშვნელობას და ვუმატებთ სტრინგს " - Even"
    else :
       #else-ის ვიყენებთ სხვა შემთხვევისთვის, რომელიც არ აკმაყოფილებს ზემოთ მოცემულ პირობას
       print(num, " - Odd") # სხვა შემთხვევებში ვპრინტავთ საიტერაციო ცვლადის მნიშვნელობას და ვუმატებთ სტრინგს " - Odd"
